<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
 <title>Scribe! - Hilfe</title>
 <meta name="generator" content="Scribe! 2 [http://scribe.de]" />
 <meta name="author" content="Jan Uhlenbrok" />
 <link rel="stylesheet" type="text/css" href="layout.css" />
</head>

<body>
<p align="center">
<span class="header">D e r&nbsp;&nbsp;&nbsp;E d i t o r</span><br />
<span class="subheader">Verwaltung</span>
</p>
<p align="justify">
Die Verwaltung umfasst 5 Bereiche:<br /><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#file_manager" class="normal">Dateimanager</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#project_manager" class="normal">Projektmanager</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#direct_ftp" class="normal">Direktes FTP</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#color_palette" class="normal">Farb - Palette</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#special_chars" class="normal">Sonderzeichen - Auswahl</a>

<hr>
<img src="graphics/file_manager.gif" alt="" height="21" width="41" border="0" align="bottom" /><br /><span class="subsubheader"><a name="file_manager" id="file_manager">Dateimanager</a></span><br /><br />
Mit Hilfe des Dateimanagers k&ouml;nnen Sie durch Verzeichnisse auf Ihrem System browsen. Der Dateimanager ist n&uuml;tzlich, wenn Sie keine Projekte anlegen oder nur schnell einige Dateien bearbeiten wollen.<br /><br />
Die Dateiliste enth&auml;lt die Dateien des aktuell gew&auml;hlten Verzeichnisses. Per Doppelklick k&ouml;nnen Dateien ge&ouml;ffnet werden. &Uuml;ber das Kontextmen&uuml; (rechte Maustaste) sind Funktionen wie <span class="menue">&nbsp;L&ouml;schen&nbsp;</span> und <span class="menue">&nbsp;Aktualisieren&nbsp;</span> abrufbar.<br /><br />
Auch die Eintr&auml;ge <span class="menue">&nbsp;Kopieren&nbsp;</span> und <span class="menue">&nbsp;Einf&uuml;gen&nbsp;</span> finden Sie hier. Damit k&ouml;nnen Sie Dateien zwischen dem Datei- und Projektmanager hin- und herkopieren. W&auml;hlen Sie dazu eine oder mehrere Dateien aus und klicken Sie auf <span class="menue">&nbsp;Kopieren&nbsp;</span>. Wechseln Sie dann zum Projektmanager und f&uuml;gen Sie die Dateien mit <span class="menue">&nbsp;Einf&uuml;gen&nbsp;</span> ein.

<hr />
<img src="graphics/project_manager.gif" alt="" height="21" width="40" border="0" align="bottom" /><br /><span class="subsubheader"><a name="project_manager" id="project_manager">Projektmanager</a></span><br /><br />
Mit Hilfe von Projekten k&ouml;nnen Sie zusammengeh&ouml;rige Dateien ordnen, um den &Uuml;berblick zu behalten. So ist es einfacher, die Daten sp&auml;ter auf einen <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#server" class="normal">Server</a> zu &uuml;bertragen. Projekte k&ouml;nnen unter dem Men&uuml;punkt <span class="menue">&nbsp;Datei/Neues Projekt...&nbsp;</span> erstellt werden.<br /><br />
Das Kontextmen&uuml; der Projektansicht enth&auml;lt Eintr&auml;ge wie beispielsweise <span class="menue">&nbsp;L&ouml;schen&nbsp;</span> und <span class="menue">&nbsp;Umbenennen&nbsp;</span>.<br /><br />
Auch hier finden Sie eine Dateiliste. Sie enth&auml;lt dieselben Funktionen wie die des <span class="arrow">&raquo;</span>&nbsp;<a href="administration.html#file_manager" class="normal">Dateimanagers</a>.

<hr />
<img src="graphics/direct_ftp.gif" alt="" height="21" width="40" border="0" align="bottom" /><br /><span class="subsubheader"><a name="direct_ftp" id="direct_ftp">Direktes FTP</a></span><br /><br />
Mit Hilfe von FTP (<b>F</b>ile <b>T</b>ransfer <b>P</b>rotocol) k&ouml;nnen Sie ihre Homepage auf einem <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#server" class="normal">Server</a> verf&uuml;gbar machen. So kann jeder Internet - Benutzer Ihre Seiten aufrufen.<br /><br />
Die FTP - Funktionen von Scribe! sind direkt in die Verwaltung integriert. Das ist &uuml;bersichtlicher und vor allem  f&uuml;r Anf&auml;nger angenehmer. Trotzdem ist das &quot;Direkte FTP&quot; genauso umfangreich wie ein externes FTP - Programm.<br /><br />
Ganz oben sehen Sie eine Auswahlbox, die die verschiedenen Profile enth&auml;lt. Wie Sie unter <img src="graphics/direct_ftp_props.gif" alt="" height="16" width="16" border="0" align="top" /> FTP - Profile anlegen, lesen Sie <span class="arrow">&raquo;</span>&nbsp;<a href="dialog_ftp_profiles.html" class="normal">hier</a>. Wenn Sie ein Profil ausw&auml;hlen und auf <img src="graphics/direct_ftp_connect.gif" alt="" height="16" width="16" border="0" align="top" /> klicken, verbindet sich Scribe! mit dem Server.<br /><br />
Wenn Sie sich zum ersten Mal verbinden, sehen Sie vermutlich noch nichts in den beiden Ansichten. Daher sollten Sie zun&auml;chst einmal einige Dateien auf den Server kopieren. Wechseln Sie dazu bitte zum Datei- oder Projektmanager, markieren die gew&uuml;nschten Dateien und <span class="menue">&nbsp;Kopieren&nbsp;</span> Sie sie per Kontextmen&uuml;. Dann gehen Sie zur&uuml;ck zum &quot;Direkten FTP&quot; und rufen Sie per Kontextmen&uuml; der unteren Ansicht den Befehl <span class="menue">&nbsp;Einf&uuml;gen&nbsp;</span> auf. Die Dateien werden nun kopiert.<br />Nat&uuml;rlich k&ouml;nnen mit Hilfe dieser beiden Funktionen auch Dateien vom Server auf den lokalen Computer heruntergeladen werden. <br /><br />
Ordner k&ouml;nnen ebenfalls auf dem Server erstellt werden. Rufen Sie dazu bitte den Befehl <span class="menue">&nbsp;Neuer Ordner...&nbsp;</span> im Kontextmen&uuml; der oberen Ansicht auf. Sie &ouml;ffnen den Ordner per Doppelklick.<br /><br />
Sie k&ouml;nnen auch Dokumente direkt auf dem Server bearbeiten. &Ouml;ffnen Sie dazu ganz einfach ein Dokument mit Doppelklick in der unteren Dateiliste, nehmen Sie die &Auml;nderungen vor und speichern (<img src="graphics/menu_save.gif" alt="" height="16" width="16" border="0" align="top" />) Sie es. Fertig.<br /><br />
Die Kontextmen&uuml;s der beiden Ansichten enthalten nat&uuml;rlich noch mehr n&uuml;tzliche Funktionen.<br /><br />
Um die Verbindung zum Server wieder zu trennen, benutzen Sie <img src="graphics/direct_ftp_disconnect.gif" alt="" height="16" width="16" border="0" align="top" />.
<hr />
<img src="graphics/color_palette.gif" alt="" height="21" width="40" border="0" align="bottom" /><br /><span class="subsubheader"><a name="color_palette" id="color_palette">Farb - Palette</a></span><br /><br />
Mit Hilfe der Farb - Palette k&ouml;nnen Sie beliebige Farb - Codes in das aktive Dokument einf&uuml;gen.<br /><br />W&auml;hlen Sie dazu eine Palette oder eine Grafik aus (<img src="graphics/open_palette.gif" alt="" height="16" width="16" border="0" align="top" />) und selektieren Sie mit Hilfe der Pipette eine Farbe, die in das Dokument eingef&uuml;gt werden soll.

<hr />
<img src="graphics/special_chars.gif" alt="" height="21" width="40" border="0" align="bottom" /><br /><span class="subsubheader"><a name="special_chars" id="special_chars">Sonderzeichen - Auswahl</a></span><br /><br />
Dieses Feld erm&ouml;glicht die Auswahl von benannten Sonderzeichen in (X)HTML. Wenn Sie zum Beispiel spitze Klammern darstellen wollen, klicken Sie einfach auf das entsprechende Zeichen.<br /><br />Sobald Sie den Mauszeiger &uuml;ber ein Zeichen bewegen, sehen Sie unten in der <span class="arrow">&raquo;</span>&nbsp;<a href="status_bar.html" class="normal">Statuszeile</a> eine kurze Beschreibung.

<hr />
<img src="graphics/tip.gif" alt="" height="16" width="16" border="0" />
Wenn Sie eine Datei aus der Dateiliste in ein ge&ouml;ffnetes Dokument ziehen, wird die Datei mit ihrem relativen Pfad eingef&uuml;gt.
</p>
</body>
</html>