<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
 <title>Scribe! - Hilfe</title>
 <meta name="generator" content="Scribe! 2 [http://scribe.de]" />
 <meta name="author" content="Jan Uhlenbrok" />
 <link rel="stylesheet" type="text/css" href="layout.css" />
</head>

<body>
<p align="center">
<span class="header">D e r&nbsp;&nbsp;&nbsp;E d i t o r</span><br />
<span class="subheader">Style-Sheet - Editor</span>
</p>
<p align="justify">
Der Style-Sheet - Editor erleichtert Ihnen den Umgang mit <span class="arrow">&raquo;</span>&nbsp;<a href="css.html" class="normal">Cascading Style-Sheets</a>.<br /><br />
Die Angaben k&ouml;nnen wahlweise mit dem internen Editor oder mit &quot;TopStyle&quot; von <span class="arrow">&raquo;</span>&nbsp;<a href="http://www.bradsoft.com" target="_blank" class="normal">bradsoft.com</a> bearbeiten werden. Die Bedienung der beiden Editoren unterscheidet sich kaum voneinander. &quot;TopStyle&quot; ist komfortabler, daf&uuml;r allerdings nur auf englisch verf&uuml;gbar. Der Editor existiert als Freeware- und Shareware - Version. Um &quot;TopStyle" in Scribe! zu benutzen, installieren Sie bitte das Programm und aktivieren in den Optionen den Punkt <span class="menue">&nbsp;TopStyle als Style-Sheet - Editor benutzen&nbsp;</span>.<hr />
Zu erreichen ist der Editor entweder
<ol>
 <li>&uuml;ber den Men&uuml;punkt <span class="menue">&nbsp;Scribe! - Tools/Style-Sheet - Editor...&nbsp;</span>,</li>
 <li>&uuml;ber den Button <img src="graphics/css.gif" alt="" height="16" width="16" border="0" align="top" />, der sich in jedem Tag-Dialog befindet,</li>
 <li>oder ganz einfach dadurch, indem Sie in eine beliebige Style-Sheet - Definition (<span class="tag">&lt;style <span class="tag_attrs">type=&quot;</span><span class="tag_values">text/css</span><span class="tag_attrs">&quot;</span>&gt;</span>) in einem Dokument klicken und <span class="shortcut">Strg+F3</span> dr&uuml;cken.</li>
</ol>
<hr />
<b>Fall 1</b> (&uuml;ber <span class="menue">&nbsp;Scribe!-Tools/Style-Sheet - Editor...&nbsp;</span>):<br />
In diesem &quot;Normal&quot; - Modus k&ouml;nnen f&uuml;r beliebig viele Tags Style-Sheet - Angaben definiert werden.
<ul>
 <li>W&auml;hlen Sie dazu zun&auml;chst einen Tag aus der oberen, rechten Auswahlliste (z.B. <b>&quot;p&quot;</b>) und klicken Sie rechts daneben auf den Button.
 <li>Platzieren Sie den Cursor zwischen die beiden spitzen Klammern.
 <li>Um dem <b>P</b>aragraph-Tag jetzt eine Schriftart zuzuweisen , w&auml;hlen Sie als Kategorie &quot;Schriftformatierung&quot;.
 <li>Selektieren Sie als Style-Sheet - Angabe den Punkt &quot;font-family&quot; und als Attribut z.B. den Eintrag &quot;Arial&quot;.
 <li>Dr&uuml;cken Sie nun den Button <span class="menue">&nbsp;&quot;Definition einf&uuml;gen&quot;&nbsp;</span>.
 <li>Um eine Schriftfarbe zu bestimmen, nehmen Sie als Style-Sheet - Angabe &quot;color&quot; und als Attribut &quot;Red&quot; f&uuml;r rot.
 <li>Dr&uuml;cken Sie <span class="menue">&nbsp;&quot;Definition einf&uuml;gen&quot;&nbsp;</span>.
 <li>Rot gef&auml;llt Ihnen nicht? Wie w&auml;r's mit blau? Klicken Sie dazu in die Definition &quot;color:Red&quot;. Die Definition wird markiert.
 <li>Selektieren Sie als Attribut &quot;Blue&quot;.
</ul>
<img src="graphics/css_example_1.gif" alt="" height="43" width="370" border="0" /><br /><br />
Die Speicherung der Angaben erfolgt &uuml;ber <span class="menue">&nbsp;Style - Sheet/Speichern unter...&nbsp;</span>.<br />
Diese Datei kann dann im Editor mit <span class="menue">&nbsp;Einf&uuml;gen/Cascading Style - Sheets/Externe Style-Sheet - Datei...&nbsp;</span> genutzt werden.
<hr />

<b>Fall 2</b> (&uuml;ber <img src="graphics/css.gif" alt="" height="16" width="16" border="0" align="top" />):<br />
Sobald Sie auf den Button geklickt haben, erscheint der Style-Sheet - Editor. Die Auswahlliste sowie andere datei - spezifische Funktionen sind deaktiviert, da die Definitionen ja nur f&uuml;r einen bestimmten Tag gelten.
<ul>
 <li>Um dem Tag eine Hintergrundfarbe zuzuweisen , w&auml;hlen Sie als Kategorie &quot;Hintergrund&quot;.</li>
 <li>Selektieren Sie als Style-Sheet - Angabe den Punkt &quot;background-color&quot; und als Attribut den Eintrag &quot;Navy&quot; f&uuml;r dunkelblau.</li>
 <li>Dr&uuml;cken Sie nun den Button <span class="menue">&nbsp;&quot;Definition einf&uuml;gen&quot;&nbsp;</span>.</li>
 <li>Sollte Ihnen dieses Blau zu dunkel sein, klicken Sie in die Style-Sheet - Definition &quot;background-color:Navy&quot;. W&auml;hlen Sie den Eintrag &quot;Blue&quot; f&uuml;r hellblau.</li>
 <li>Um diese Definitionen nun dem Tag zuzuweisen, benutzen Sie den Men&uuml;punkt <span class="menue">&nbsp;Style - Sheet/Angaben &uuml;bernehmen&nbsp;</span>.</li>
</ul>
<img src="graphics/css_example_2.gif" alt="" height="50" width="312" border="0" />
<hr />

<b>Fall 3</b> (&uuml;ber Strg+F3 oder Kontextmen&uuml;):<br>
Nachbearbeitet werden k&ouml;nnen alle Style-Sheet - Definitionen, die sich entweder im Bereich des <span class="tag">&lt;style&gt;</span> - Tags in einem Dokument befinden.<br />
F&uuml;r eine Nachbearbeitung klicken Sie in die <span class="tag">&lt;style <span class="tag_attrs">type=&quot;</span><span class="tag_values">text/css</span><span class="tag_attrs">&quot;</span>&gt;</span> - Angabe und w&auml;hlen Sie die Tasten <span class="shortcut">Strg+F3</span> oder den Eintrag <span class="menue">&nbsp;Style-Sheet - Zuweisungen bearbeiten...&nbsp;</span> im Kontextmen&uuml;.
</p>

</body>
</html>