<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
 <title>Scribe! - Hilfe</title>
 <meta name="generator" content="Scribe! 2 [http://scribe.de]" />
 <meta name="author" content="Jan Uhlenbrok" />
 <link rel="stylesheet" type="text/css" href="layout.css" />
</head>

<body>
<p align="center">
<span class="header">D e r&nbsp;&nbsp;&nbsp;E d i t o r</span><br />
<span class="subheader">Thumbnail - Generator</span>
</p>
<p align="justify">
Mit diesem Tool k&ouml;nnen Sie Vorschaugrafiken, sogenannte Thumbnails, erstellen. Der Generator verkleinert eine Gruppe von Grafiken (zum Beispiel Fotos) und verteilt Sie auf mehrere Seiten, durch die dann navigiert werden kann. Das verringert die Ladezeiten und ist &uuml;bersichtlicher.<br /><br />

<span class="menue">&nbsp;Quellverzeichnis&nbsp;</span><br />
Verzeichnis, das die Grafiken (nur *.jpg bzw. *.jpeg) enth&auml;lt, die verkleinert werden sollen.<br /><br />
<span class="menue">&nbsp;Aufteilung&nbsp;</span><br />
Bestimmt die Aufteilung der einzelnen Seiten.<br /><br />
<span class="menue">&nbsp;Ausgabeh&ouml;he&nbsp;</span><br />
H&ouml;he, auf die die Grafiken verkleinert werden sollen.<br /><br />
<span class="menue">&nbsp;Ausgabebreite&nbsp;</span><br />
Breite, auf die die Grafiken verkleinert werden sollen.<br /><br />
<span class="menue">&nbsp;Dateiname(n)&nbsp;</span><br />
Bestimmt die Namen, unter denen die einzelnen Seiten gespeichert werden sollen. Das &quot;<b>#</b>&quot; wird dann durch 1, 2, ... ersetzt.<br /><br />
<span class="menue">&nbsp;Thumbnail - Vorlage&nbsp;</span><br />
Das hier gew&auml;hlte Dokument wird als Vorlage f&uuml;r die Thumbnail - Seiten verwendet. Die Vorlage mu&szlig; die Variable &quot;<b>#Cursor</b>&quot; enthalten. An dieser Position wird dann die Tabelle mit den Grafiken eingef&uuml;gt.<br /><br />
<span class="menue">&nbsp;Einzelbild - Vorlage&nbsp;</span><br />
Die gew&auml;hlte Vorlage wird f&uuml;r die einzelnen Grafiken verwendet. Die Vorlage mu&szlig; die Variable &quot;<b>#Cursor</b>&quot; enthalten. An dieser Position wird die Grafik eingef&uuml;gt.<br /><br />
<span class="menue">&nbsp;Zielverzeichnis&nbsp;</span><br />
Verzeichnis, in das alle Dateien (Grafiken, Seiten) kopiert werden sollen.<br /><br />
<span class="menue">&nbsp;Startseite&nbsp;</span><br />
Dokument, auf das von jeder Seite aus verlinkt wird (&quot;Home&quot; - Seite).<br /><br />
<span class="menue">&nbsp;Beschriftungen&nbsp;</span><br />
Verschiedene Informationen zur Grafik.<br /><br />
<span class="menue">&nbsp;Filter&nbsp;</span><br />
Verschiedene Filter, die bei der Gr&ouml;&szlig;en&auml;nderung eingesetzt werden. &quot;Triangle&quot; ist der schnellste Filter, daf&uuml;r liefert &quot;Mitchell&quot; genauere Ergebnisse.<br /><br />
<span class="menue">&nbsp;Qualit&auml;t&nbsp;</span><br />
Bestimmt die Qualit&auml;t der Grafiken. Je kleiner der Qualit&auml;tswert, desto kleiner ist allerdings auch die Gr&ouml;&szlig;e der Datei.<br /><br />

<img src="graphics/tip.gif" alt="" height="16" width="16" border="0" />
&Uuml;ber das Kontext - Men&uuml; (rechte Maustaste) der Grafiken - Liste k&ouml;nnen einzelne Eintr&auml;ge auch wieder entfernt werden.
</p>
</body>
</html>