<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de">
<head>
 <title>Scribe! - Hilfe</title>
 <meta name="generator" content="Scribe! 2 [http://scribe.de]" />
 <meta name="author" content="Jan Uhlenbrok" />
 <link rel="stylesheet" type="text/css" href="layout.css" />
</head>

<body>
<p align="center">
<span class="header">E i n f &uuml; h r u n g</span><br />
<span class="subheader">Erste Hilfe</span>
</p>

Willkommen bei Scribe!.<br /><br />
Dieses Dokument gliedert sich in Abschnitte, die auf die ersten Schritte mit Scribe! (angefangen mit dem &quot;Willkommen&quot; - Dialog) zugeschnitten sind. Sie können schrittweise vorgehen oder durch einen Klick auf die Links ein Thema anspringen.<br /><br />
Eine kleine Einführung in (X)HTML finden Sie <span class="arrow">&raquo;</span>&nbsp;<a href="xhtml_intro.html" class="normal">hier</a>. 
<hr />
<span class="arrow">&raquo;</span>&nbsp;<a href="#welcome" class="normal">Der &quot;Willkommen&quot; - Dialog</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#pagewizard" class="normal">Der Seiten - Assistent</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#properties" class="normal">Die Eigenschaften der Seite</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#browser" class="normal">Anzeigen der Seite in einem Browser</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#text" class="normal">Text eingeben und Hyperlinks</a><br />
<span class="arrow">&raquo;</span>&nbsp;<a href="#postprocess" class="normal">Nachbearbeiten der Seite</a> 
<hr />

<span class="subsubheader"><a name="welcome" id="welcome">1.</a> Der &quot;Willkommen&quot; - Dialog</span><br /><br />
Dieser erste Dialog fordert Sie zur Erstellung eines Projekts auf. Scribe! basiert auf dieser Art der Projektverwaltung. So ist es einfach, sp&auml;ter die Daten organsiert auf einem <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#server" class="normal">Web - Server</a> abzulegen.<br /><br />
Geben Sie unter Projektname eine Bezeichnung f&uuml;r Ihr Projekt ein. Au&szlig;erdem d&uuml;rfen noch Projekt - Unterordner erstellt werden, um mehr &Uuml;bersicht zu schaffen. Diese k&ouml;nnen aber auch sp&auml;ter erstellt werden. Klicken Sie auf <span class="menue">&nbsp;"OK"&nbsp;</span>.<br /><br />
Mit <span class="menue">&nbsp;"Schlie&szlig;en"&nbsp;</span> wird zwar kein Projekt erstellt, daf&uuml;r wird der Dateimanager angezeigt. Damit k&ouml;nnen Sie Internet - Dokumente in einem beliebigen Verzeichnis erstellen und bearbeiten.<br /><br />
Projekte k&ouml;nnen nat&uuml;rlich auch zu einem sp&auml;teren Zeitpunkt angelegt werden.<br />
<hr />

<span class="subsubheader"><a name="pagewizard" id="pagewizard">2.</a> Der Seiten - Assistent</span><br /><br />
Der Seiten - Assistent vereinfacht die Erstellung eines XHTML - Dokumentes. Er kann auch später über <span class="menue">&nbsp;Datei/Neu...&nbsp;</span> abgerufen werden.<br /><br />
Unter <span class="menue">&nbsp;Titel der Seite&nbsp;</span> geben Sie einen Text ein, der im <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#browser" class="normal">Browser</a> in der oberen Zeile angezeigt wird (so wie hier "Scribe! - Hilfe").<br /><br />
Im Feld <span class="menue">&nbsp;Autor&nbsp;</span> sollten Sie Ihren Namen angeben.<br /><br />
<span class="menue">&nbsp;Schlüsselwörter&nbsp;</span> umreissen die Themen Ihrer Seite. Die einzelnen Wörter sind durch Kommata zu trennen.<br /><br />
Eine kurze Inhaltsangabe Ihrer Seite in Sätzen schreiben Sie ins Feld <span class="menue">&nbsp;Beschreibung&nbsp;</span>.<br /><br />
Die Inhalte der Felder &quot;Autor&quot;, &quot;Schlüsselwörter&quot; und &quot;Beschreibung&quot; werden in Form von <span class="arrow">&raquo;</span>&nbsp;<a href="tag_meta.html" class="normal">Metatags</a> im (X)HTML - Dokument gespeichert. Metatags enthalten verschiedene Anweisungen für Browser und vor allem f&uuml;r Suchmaschinen.<br /><br />
Bestätigen Sie mit <span class="menue">&nbsp;"OK"&nbsp;</span>.
<hr /> 

<span class="subsubheader"><a name="properties" id="properties">3.</a> Die Eigenschaften der Seite</span><br /><br />
Dieser Dialog bezieht sich im Wesentlichen auf das Aussehen der Seite. Hier k&ouml;nnen die Farben f&uuml;r Hintergrund, <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#links" class="normal">Links</a> und normalen Text festgelegt werden. Au&szlig;erdem besteht die M&ouml;glichkeit, ein Hintergrundbild zu definieren. Dieser Dialog ist sp&auml;ter &uuml;ber <img src="graphics/body.gif" alt="" height="16" width="16" border="0" align="top" /> zu erreichen.<br /><br />
W&auml;hlen Sie nun Farben f&uuml;r den Hintergrund, den Text und f&uuml;r einen normalen (Hyper-) Link aus, indem Sie auf die entsprechenden <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#buttons" class="normal">Buttons</a> klicken und eine Farbe bestimmen.<br /><br />
Wenn Sie damit fertig sind, best&auml;tigen Sie mit <span class="menue">&nbsp;"OK"&nbsp;</span>.<br /><br />
Ihre Seite wird nun im Quelltext im Editor dargestellt.
<hr /> 

<span class="subsubheader"><a name="browser" id="browser">4.</a> Anzeigen der Seite in einem Browser</span><br /><br />
Betrachten Sie nun die Seite in einem <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#browser" class="normal">Browser</a>.<br />
Klicken Sie dazu auf <img src="graphics/browser.gif" alt="" height="16" width="16" border="0" align="top" /> und w&auml;hlen Sie aus der Liste einen Browser aus.<b>*</b><br />
Nun wird gefragt, ob die Datei gespeichert werden soll. Best&auml;tigen Sie mit &quot;Ja&quot;. Die Datei erscheint in der Dateiliste.<br />
Sobald der Browser fertig geladen ist, wird Ihre Internet - Seite angezeigt. Immerhin schon etwas, aber noch ein bi&szlig;chen textlos.<br />
<br />
<b>*</b> Sollte die Liste leer sein, haben Sie vermutlich keinen Browser installiert oder Scribe! konnte keinen finden. Wenn der erste Fall zutrifft, durchsuchen Sie mal Ihre Shareware- und Heft - CD-Roms. Darauf befindet sich meist eine aktuelle Version der bekannteren Browser.<br />
Haben Sie einen Browser auf Ihrem System installiert, rufen Sie den Options - Dialog unter <span class="menue">&nbsp;Scribe! - Tools/Optionen...&nbsp;</span> auf. Unter dem Registerreiter "Browser" haben Sie die M&ouml;glichkeit, drei Browser zu definieren. <br />
Der interne Browser ist nur vorhanden, wenn der &quot;Microsoft Internet Explorer&reg;&quot; ab Version 4 installiert ist.
<hr /> 

<span class="subsubheader"><a name="text" id="text">5.</a> Text eingeben und Hyperlinks</span><br /><br />
Wechseln Sie wieder zum Scribe! - Fenster. Plazieren Sie den Textcursor zwischen den beiden <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#tags" class="normal">Tags</a> <span class="tag">&lt;body&gt;</span> und <span class="tag">&lt;/body&gt;</span>.<br />Geben Sie dort z.B. den Text &quot;Willkommen auf meiner Homepage!&quot; ein.<br /><br />
Markieren Sie den Text und klicken auf den Button <img src="graphics/bold.gif" alt="" height="16" width="16" border="0" align="top" /> der sich auf dem rechten oberen Paneel unter der Gruppe &quot;Format&quot; befindet. Der <span class="tag">&lt;b&gt;</span> - Tag wird vorne bzw. hinten angeh&auml;ngt, der die Schrift im <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#browser" class="normal">Browser</a> fett darstellt.<br /><br />
Um die &Uuml;berschrift zu zentrieren, benutzen Sie den <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#buttons" class="normal">Button</a> <img src="graphics/center.gif" alt="" height="16" width="16" border="0" align="top" />.<br /><br />
Plazieren Sie nun den Textcursor eine Zeile unterhalb der aktuellen Zeile. Klicken Sie 3 mal auf den Button <img src="graphics/break.gif" alt="" height="16" width="16" border="0" align="top" /> unter der Gruppe &quot;Allgemein&quot;, um 3 Zeilenumbr&uuml;che einzuf&uuml;gen.<br />
Schaffen Sie sich mit der Enter/Return - Taste etwas Platz unterhalb der Zeilenumbr&uuml;che.<br /><br />
Geben Sie anderen Text ein, z.B. &quot;Das ist meine Lieblings-Internet-Adresse:&quot;. Markieren Sie den Text und zentrieren Sie ihn (<img src="graphics/center.gif" alt="" height="16" width="16" border="0" align="top" />).<br /><br />
Plazieren Sie einen Zeilenumbruch hinter dem eingegebenen Text (<img src="graphics/break.gif" alt="" height="16" width="16" border="0" align="top" />), aber noch vor dem <span class="tag">&lt;/p&gt;</span> - Tag. Zur optischen Verbesserung dr&uuml;cken Sie zus&auml;tzlich einmal die Enter/Return - Taste. F&uuml;gen Sie hier eine Internet - Addresse oder eine Beschreibung ein (z.B. &quot;http://www.scribe.de&quot; oder auch &quot;Zur Scribe! - Homepage&quot;). Markieren Sie die Adresse und klicken Sie auf <img src="graphics/hyperlink.gif" alt="" height="16" width="16" border="0" align="top" /> unter &quot;Allgemein&quot;, um den Hyperlink - Dialog aufzurufen.<br /><br />
In dem Dialog geben Sie f&uuml;r <span class="menue">Ziel</span> eine Internet - Adresse an, in diesem Fall also &quot;http://www.scribe.de&quot;. Best&auml;tigen Sie mit <span class="menue">&nbsp;"OK"&nbsp;</span>. Der <span class="tag">&lt;a&gt;</span> - Tag wird voran- bzw. angeh&auml;ngt, der einen <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#links" class="normal">Hyperlink</a> beschreibt.<br /><br />
So, das m&uuml;ßte alles gewesen sein. Betrachten Sie Ihre Homepage jetzt im Browser mit <img src="graphics/browser.gif" alt="" height="16" width="16" border="0" align="top" />.<br /><br />
Hier noch zur Kontrolle ein Blick in den Quelltext (der Quelltext wurde zur besseren &Uuml;bersicht geordnet):<br /><br /><img src="graphics/source.gif" alt="" height="237" width="471" border="0" />
<hr />

<span class="subsubheader"><a name="postprocess" id="postprocess">6.</a> Nachbearbeiten der Seite</span><br /><br />
Ein besondere Eigenschaft von Scribe! ist die Möglichkeit, <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#tags" class="normal">Tags</a> durch ihren jeweiligen Dialog nachzubearbeiten. <br /><br />
Wenn Sie z.B. eine andere Hintergrundfarbe einstellen wollen, klicken Sie einmal mit der linken Maustaste in den <span class="tag">&lt;body&gt;</span> - Tag.<br />
Wählen Sie nun aus dem Kontextmenü (rechte Maustaste) den ersten Eintrag <span class="menue">&nbsp;Seiteneigenschaften bearbeiten&nbsp;</span> aus oder benutzen Sie den <span class="arrow">&raquo;</span>&nbsp;<a href="terms.html#shortcuts" class="normal">Shortcut</a> <span class="shortcut">Strg+F3</span>.<br /><br />
Der Dialog mit Einstellmöglichkeiten der Seiteneigenschaften wird geöffnet und die vorhandenen Attribute werden zugewiesen. Nehmen Sie die gewünschten Änderungen vor. Mit <span class="menue">&nbsp;"OK"&nbsp;</span> werden die geänderten Attribute dem Tag zugeordnet.<br /><br />
Diese Vorgehensweise klappt mit jedem Tag, der über einen Dialog einfügbar ist.<br /><br />
Viel Spaß. <br />
</p>
</body>
</html>